# acquire_exercises

In [1]:
import pandas as pd
import numpy as np
import os

#### 4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
# 4a print the first three rows

data('iris').head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [3]:
# print the number of rows and columns

data('iris').shape

(150, 5)

In [4]:
# print the column names
# print the data types of each column

data('iris').info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [5]:
# print the summary statistics for each of the numeric variables. 
#     Would you recommend rescaling the data based on these statistics?

data('iris').describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

#### 5. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [14]:
# 1st 100 rows

df_excel = pd.read_excel('Excel_Exercises.xlsx', sheet_name = 'Table1_CustDetails')
df_excel_sample = df_excel.head(100)

In [15]:
# no of rows in original df

df_excel.shape[0]

7049

In [22]:
# column names

df_excel.columns

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents',
       'phone_service', 'internet_service', 'contract_type', 'payment_type',
       'monthly_charges', 'total_charges', 'churn', 'Unnamed: 12',
       'Unnamed: 13'],
      dtype='object')

In [23]:
df_excel.dtypes

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
Unnamed: 12          float64
Unnamed: 13          float64
dtype: object

In [24]:
df_excel.describe()

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges,Unnamed: 12,Unnamed: 13
count,7049.000000,7049.000000,7049.000000,7049.000000,7049.000000,7038.000000,0.0,0.0
mean,0.162009,1.324585,1.222585,0.690878,64.747014,2283.043883,NaN,NaN
std,0.368485,0.642709,0.779068,0.833757,30.099460,2266.521984,NaN,NaN
min,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000,NaN,NaN
25%,0.000000,1.000000,1.000000,0.000000,35.450000,401.587500,NaN,NaN
50%,0.000000,1.000000,1.000000,0.000000,70.350000,1397.100000,NaN,NaN
75%,0.000000,2.000000,2.000000,1.000000,89.850000,3793.775000,NaN,NaN
max,1.000000,2.000000,2.000000,2.000000,118.750000,8684.800000,NaN,NaN

In [37]:
print(f'gender: {df_excel.gender.nunique()}')
print(f'is_senior_citizen: {df_excel.is_senior_citizen.nunique()}')
print(f'partner: {df_excel.partner.nunique()}')
print(f'dependents: {df_excel.dependents.nunique()}')
print(f'internet_service: {df_excel.internet_service.nunique()}')
print(f'phone_service: {df_excel.phone_service.nunique()}')
print(f'payment_type: {df_excel.payment_type.nunique()}')
print(f'contract_type: {df_excel.contract_type.nunique()}')
print(f'churn: {df_excel.churn.nunique()}')

gender: 2
is_senior_citizen: 2
partner: 2
dependents: 2
internet_service: 3
phone_service: 3
payment_type: 4
contract_type: 3
churn: 2